# Завдання 9_2
# Використовуючи цикл for
# Рівень 1
# Завдання 1
# Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі числа в цьому діапазоні за
# таким правилом: якщо число кратне 7, його треба виводити на екран.
start = int(input("Enter start: "))
finish = int(input("Enter finish: "))
for i in range(start, finish):
    if i % 7 == 0:
        print(i)
# Завдання 2
# Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі числа в цьому діапазоні.
# Потрібно вивести на екран:
# Усі числа діапазону.
# Усі числа діапазону в спадному порядку.
# Усі числа, кратні 7.
# Кількість чисел, кратних 5.
start = int(input("Enter start: "))
finish = int(input("Enter finish: "))
for i in range(start, finish+1):
    print(i)
for i in range(finish, start-1, -1):
    print(i)
for i in range(start, finish+1):
    if i % 7 == 0:
        print(i)

count = 0
for i in range(start, finish+1):
    if i % 5 == 0:
        count += 1
print(f"Count number(% 5) in range: {count}")
# Завдання 10_1
# Використовуючи цикл for
# Рівень 2
# Завдання 3
# Користувач вводить із клавіатури два числа (початок і кінець
# діапазону). Потрібно проаналізувати всі числа в цьому діапазоні.
# Виведення на екран має відбуватися за правилами, зазначеними нижче.
# Якщо число кратне 3 (ділиться на 3 без залишку) потрібно
# вивести слово "Fizz". Якщо число кратне 5 потрібно вивести слово
# "Buzz". Якщо число кратне 3 і 5 потрібно вивести "Fizz Buzz".
# Якщо число не кратне не 3 і 5 потрібно вивести саме число.
start = int(input("Enter start: "))
finish = int(input("Enter finish: "))
for i in range(start, finish+1):
    if i % 3 == 0 and not i % 5 == 0:
        print("Fizz")
    elif i % 5 == 0 and not i % 3 == 0:
        print("Buzz")
    elif i % 3 == 0 and i % 5 == 0:
        print("Fizz Buzz")
    else:
        print(i)
# Завдання 4
# Користувач вводить два числа і крок (інтервал), з яким потрібно
# проходити по діапазону. Програма має показати числа від початку
# діапазону до кінця, збільшуючи кожне число на вказаний крок.
# Також програма повинна надавати вибір порядку виведення:
# у прямому або зворотному порядку.
start = int(input("Enter start: "))
finish = int(input("Enter finish: "))
print("1) >")
print("2) <")
do = int(input("Enter your choice: "))
if do == 1:
    for i in range(start, finish+1):
        print(i)
elif do == 2:
    for i in range(finish, start - 1, -1):
        print(i)
# Завдання 10_2
# Використовуючи цикл for
# Рівень 3
# Завдання 5
# Користувач вводить два числа, що представляють діапазон.
# Програма повинна пройти по діапазону і вивести добуток усіх чисел,
# які діляться на 4, але не діляться на 6. Якщо таких чисел немає,
# вивести відповідне повідомлення. Діапазон має автоматично
# нормалізуватися, якщо початок більший за кінець.
start = int(input("Enter start: "))
finish = int(input("Enter finish: "))
for i in range(start, finish+1):
    if i % 4 == 0 and not i % 6 != 0:
        print(i*i)
    else:
        print("Not number")
# Завдання 6
# Користувач вводить два числа: число A і ступінь N, у який потрібно
# піднести число. Програма повинна обчислити A у степені N за допомогою
# циклу (без використання вбудованих функцій піднесення до степеня).
a = int(input("Enter a number: "))
n = int(input("Enter a number: "))
result = 1
for i in range(n):
    result *= a
print(result)