# Завдання 4
# Користувач із клавіатури вводить список цілих чисел. Необхідно
# реалізувати циклічний зсув списку вправо на N позицій. Результат вивести
# на екран.
# Приклад:
# Вхідні дані:
# Список чисел: 1, 2, 3, 4, 5.
# Число позицій N: 2.
# Очікуваний результат:
# Зсунутий список: [4, 5, 1, 2, 3].

# from random import randint

# arr = [randint(0, 20) for _ in range(5)]
# print("Arr: ", end="")
# for item in arr:
#     print(item, end=" ")

# n = int(input("\nEnter n: "))

# n %= len(arr)

# newArr = arr[-n:] + arr[:-n]

# print("New arr: ", end="")
# for i in newArr:
#     print(i, end=" ")

# Завдання 5
# Два списки цілих заповнюються випадковими числами. Необхідно:
# Сформувати третій список, що містить елементи обох списків;
# Сформувати третій список, що містить елементи обох списків без
# повторень;
# Сформувати третій список, що містить елементи спільні для двох
# списків;
# Сформувати третій список, що містить тільки унікальні елементи
# кожного зі списків;
# Сформувати третій список, що містить тільки мінімальне і
# максимальне значення кожного зі списків.

# from random import randint

# arr1 = [randint(1, 10) for _ in range(5)]
# arr2 = [randint(1, 10) for _ in range(5)]

# print(f"Список 1: {arr1}")
# print(f"Список 2: {arr2}\n")

# res1 = arr1 + arr2
# print(f"1. {res1}")

# res2 = list(set(arr1) | set(arr2))
# print(f"2. {res2}")

# res3 = list(set(arr1) & set(arr2))
# print(f"3. {res3}")

# res4 = list(set(arr1) ^ set(arr2))
# print(f"4. {res4}")

# res5 = [min(arr1), max(arr1), min(arr2), max(arr2)]
# print(f"5. {res5}")



# Завдання 6
# Користувач вводить список цілих чисел. Необхідно відсортувати список
# так, щоб числа чергувалися: спочатку найменше, потім найбільше, потім
# друге за величиною, друге за мінімальністю тощо.
# Приклад:
# Вхідні дані: [4, 1, 7, 2, 9, 3].
# Очікуваний результат: [1, 9, 2, 7, 3, 4].

# oldArr = [4, 1, 7, 2, 9, 3]

# oldArr.sort()
# newArr = []
# left = 0
# right = len(oldArr) - 1

# while left <= right:
#     newArr.append(oldArr[left])
#     left += 1

#     if left <= right:
#         newArr.append(oldArr[right])
#         right -= 1

# print(f"Old arr: {oldArr}")
# print(f"New arr: {newArr}")