# Напишіть функцію, яка повертає суму чисел у вказаному діапазоні. Межі
# діапазону передаються як параметри. Якщо межі діапазону переплутані
# (наприклад, 5 — верхня межа, 25 — нижня межа), їх потрібно поміняти
# місцями.
def For(s, f):
    if s > f:
        s, f = f, s

    sum = 0
    for i in range(s, f+1):
        sum += i
    return sum

print(For(1,10))

# Завдання 8
# Напишіть функцію, що обчислює добуток елементів списку цілих. Список
# передається як параметр. Отриманий результат повертається з функції.
def Mylti(arr):
    myl = 1
    for i in arr:
        myl *= i
    return myl


arr = [1, 2, 3, 4, 5]
print(Mylti(arr))
